mainMenu = "----------------------------\n" \
           "1、登陆\n" \
           "2、注册\n" \
           "3、退出游戏\n" \
           "----------------------------"

funcMenu = "----------------------------\n" \
           "1、广播\n" \
           "2、私聊\n" \
           "3、在线礼包\n" \
           "4、动作\n" \
           "5、退出账号\n" \
           "----------------------------"

actMenu = "----------------------------\n" \
          "1、攻击\n" \
          "2、恢复\n" \
          "3、个人状态\n" \
          "4、返回\n" \
          "----------------------------"


class Menu():
    def __init__(self):
        self.mainMenu = mainMenu
        self.funcMenu = funcMenu
        self.actMenu = actMenu
